{
  "backend/main.mo": "Main Motoko actor implementing a news portal backend with access-controlled user profile management and article CRUD operations, seeded with sample Bhojpuri news articles via an admin-only `init` function.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — replacing the Hindi brand name string and refining the sticky header — to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, describing key changes such as English label updates, font replacements, and bug fixes across components, hooks, pages, and config files.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes via CSS custom properties, with base styles applying background and foreground colors to the body.",
  "frontend/index.html": "HTML entry point with English lang attribute, the page title 'Sumita Bhojpuri News', and Google Fonts loading Inter and Merriweather typefaces.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, article detail, admin login, and admin dashboard, wrapped in a next-themes ThemeProvider defaulting to light mode.",
  "frontend/src/components/ArticleForm.tsx": "Controlled form component for creating and editing articles, with English labels and validation, supporting all Article fields including category select, featured/trending toggles, and a loading state.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Animated horizontal ticker displaying up to six trending article titles as links, with a duplicated set for seamless CSS looping and an English 'Breaking' label.",
  "frontend/src/components/CategoryBadge.tsx": "Small presentational component rendering a color-coded category label span using the `getCategoryBadgeClass` utility.",
  "frontend/src/components/FeaturedBanner.tsx": "Full-width hero banner component displaying a featured article with a gradient overlay, 'Featured' badge, category badge, title, description, and formatted date, linking to the article detail page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, category links, quick links, copyright, and a caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, desktop/mobile search, category navigation, and a light/dark theme toggle.",
  "frontend/src/components/NewsCard.tsx": "Displays a single article as a card in three layout variants: default (vertical), horizontal, and compact.",
  "frontend/src/components/RelatedNews.tsx": "Shows up to four related articles (excluding the current one) in a responsive grid using NewsCard.",
  "frontend/src/components/TrendingSidebar.tsx": "Sidebar listing up to five trending articles with numbered rank, thumbnail, and title.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (anonymous or authenticated) and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useCategoryFilter.ts": "Provides category state and a memoized filtered article list based on the selected category.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, exposing login/logout, identity state, and a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on articles (get, add, update, delete, init) and admin/auth queries (isCallerAdmin, getCallerUserProfile) using a backend actor.",
  "frontend/src/hooks/useTheme.ts": "Custom hook that manages light/dark theme state, persisting the preference to localStorage and syncing it with the document root class.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for light and dark themes, and reusable component classes like category badges and header styles.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names, formatting dates, mapping category names to badge CSS classes, and generating placeholder image paths.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that lists articles in a table and supports adding, editing, and deleting articles, with access restricted to authenticated admin users.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and redirects to the dashboard if the caller has admin privileges.",
  "frontend/src/pages/ArticleDetail.tsx": "Article detail page that fetches and displays a single article by ID along with related articles from the same category, with loading and not-found states.",
  "frontend/src/pages/Home.tsx": "Main homepage component that fetches articles, supports category filtering and search, and renders the Header, BreakingNewsTicker, FeaturedBanner, NewsCard grid, TrendingSidebar, and Footer with loading skeletons.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (including hash-based routing), persist them to sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Merriweather), CSS-variable-based color tokens (including news-category colors), border radii, ticker animation, and the tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state snapshot (version 7) describing the 'Sumita Bhojpuri News' Hindi news site's architecture, existing features (homepage, article detail, admin panel, dark/light mode), and known issues."
}